# Завдання: Підрахунок частоти слів у списку
# Опис Завдання:
# Створіть програму, яка приймає список слів і підраховує, як часто кожне слово
# з'являється у цьому списку. Результат має бути у вигляді списку об'єктів namedtuple,
# де кожен об'єкт містить слово та його частоту.
#
# Вимоги:
#
# Використовуйте namedtuple для зберігання слова і його частоти.
# Створіть словник для підрахунку частоти слів.
# Виведіть результат у вигляді списку namedtuple.
# Приклад Вхідних Даних:
#
# Список слів: ['apple', 'banana', 'apple', 'orange', 'banana', 'apple']
# Приклад Виходу:
#
# [
#     WordFrequency(word='apple', frequency=3),
#     WordFrequency(word='banana', frequency=2),
#     WordFrequency(word='orange', frequency=1)
# ]