# Завдання: Перевірка на парність
# Напишіть програму на Python, яка перевіряє, чи є введене користувачем число парним.
#
# Запитайте користувача про число.
# Використайте умовний оператор, щоб визначити, чи є число парним.
# Виведіть повідомлення про результат перевірки.

num = int(input('Введіть число: '))

if num % 2:
    print('Число непарне')
else:
    print('Число парне')

def is_even(num):
    if num % 2 == 0:
        print('Число парне')
    else:
        print('Число непарне')

is_even(int(input('Введіть число: ')))
