# Перевірка паролю
# буде змінна password, яку ми задаємо з консолі, і потім є змінна count(кількість спроб ввести пароль)
# якщо користувач ввів пароль 'qwerty' то тоді вивести на екран шо він ввійшов в систему, якщо ж
# кількість його спроб дорівнює 3, то вивести на екран спробуйте ввести пароль пізніше і зупинити виконання циклу
password_correct = 'qwerty'
count = 3
while count > 0:
    password = input('Введіть пароль: ')
    if password == password_correct:
        print('Ви ввійшли в систему')
        break
    count -= 1
    print('Неправильний пароль, спробуйте ще')

if count == 0:
    print('Спроби закінчились')
