# Завдання: Перевірка на паліндром
# Напишіть програму, яка перевіряє, чи є введений користувачем рядок паліндромом
# (слово або фраза, яка читається однаково в обох напрямках, ігноруючи пробіли,
# регістр літер та розділові знаки).
#
# Приклад використання:
# Введіть рядок: "А роза упала на лапу Азора"
# Рядок "А роза упала на лапу Азора" є паліндромом.
#
# Введіть рядок: "Python programming"
# Рядок "Python programming" не є паліндромом.
# Ідея розв'язку:
# Запросити користувача ввести рядок.
# Видалити з рядка всі розділові знаки та пробіли.
# Перевести весь рядок в нижній регістр для однакового порівняння.
# Перевірити, чи відповідає рядок своєму "відображенню" (рядок, що читається в зворотному напрямку).

def is_palindrome(s: str):
    filtered_string = ''
    s = s.lower()
    s = s.replace(',', '').replace(' ', '')
    for word in s:
        if word.isalpha():
            filtered_string += word


