"""
Опис
Створи програму для управління бібліотекою. Використай класи, щоб описати книги
та саму бібліотеку.

Вимоги
Створи клас Book.
Він повинен містити:

Атрибут title (назва книги).
Атрибут author (автор книги).
Атрибут year (рік видання).
Метод info(), який повертає рядок із інформацією про книгу у форматі:
"Назва: <title>, Автор: <author>, Рік: <year>".
Створи клас Library.
Він повинен містити:

Список книг books (спочатку порожній).
Метод add_book(book), який додає книгу до бібліотеки.
Метод remove_book(title), який видаляє книгу за її назвою.
Метод find_books_by_author(author), який повертає список усіх книг цього автора.
Метод display_books(), який виводить інформацію про всі книги в бібліотеці.
"""