# Як ми знаємо, ключ у словнику має бути унікальним, тоді як значення його ні.
# Реалізуйте функцію lookup_key для пошуку всіх ключів за значенням у словнику.
# Першим параметром у функцію ми передаємо словник, а другим — значення, що
# хочемо знайти. Таким чином, результат може бути як список ключів, так і порожній
# список, якщо ми нічого не знайдемо.

# {'Sasha': '+380937316050', 'Masha': '+380937316050', 'Oksana': '+380937316050'}

def lookup_key(data, value):
    result = []
    for key in data:
        if data[key] == value:
            result.append(key)
    return result


print(lookup_key({'Sasha': '+380937316050', 'Masha': '+380937316050', 'Oksana': '+380937316051'}, '+380937316050'))
