# Завдання: Аналіз Даних про Погоду
# У вас є список з температурних записів, і ви повинні обробити ці дані для
# отримання кількох статистичних показників.
#
# Дані
# Вам дано список словників, де кожен словник представляє температуру в певний день:
# 1 Список Температур: Використовуючи функцію map, створіть список температур.
#
# 2 Фільтрація Температур: Використовуючи функцію filter, створіть список температур,
# які перевищують 22 градуси.
#
# 3 Підрахунок Днів з Температурою вище 22 градусів: Використовуючи функцію filter,
# підрахуйте кількість днів, коли температура перевищувала 22 градуси.

# Дані
weather_data = [
    {"date": "2024-09-01", "temperature": 22},
    {"date": "2024-09-02", "temperature": 24},
    {"date": "2024-09-03", "temperature": 20},
    {"date": "2024-09-04", "temperature": 26},
    {"date": "2024-09-05", "temperature": 18},
    {"date": "2024-09-06", "temperature": 23},
    {"date": "2024-09-07", "temperature": 27}
]
