# Напишіть функцію, яка обчислює середнє значення кортежу чисел(формату (1, 2, 3, 4, 5)).
# Функція має приймати кортеж чисел як вхідний параметр і повертати середнє значення цих чисел.
# підказка: середнє значення обраховується як сума всіх чисел кортежу розділене на к-сть елементів
# в ньому, к-сть елементів можна знайти за допомогою функції len()

def func1(numbers):
    count = 0
    for i in numbers:  # (1, 2, 3, 4, 5)
        count += i  # count = 0, i = 1, count = 1, i = 2, count = 3, i = 3, count = 6, i = 4, count = 10, i = 5, count = 15
    return count / len(numbers)


print(func1((1, 2, 3, 4, 5)))